In [1]:
import pandas as pd
import numpy as np

In [2]:
data_emp    = {'name':['suresh','ramesh','alice','bob','mahesh','virat','sachin','gill','shubham','sonam','jagu','ishan','kisan','harry','sundhar','dulqar salman'],
               'age': [21,23,23,24,26,32,np.nan,45,32,np.nan,34,34,41,42,23,np.nan],
               'salary':[10000,30000,32000,20000,29000,45000,34000,10000,21000,10020,38000,23000,23900,21000,45000,30000]}
df = pd.DataFrame(data_emp)

In [3]:
df.isnull()

     name    age  salary
0   False  False   False
1   False  False   False
2   False  False   False
3   False  False   False
4   False  False   False
5   False  False   False
6   False   True   False
7   False  False   False
8   False  False   False
9   False   True   False
10  False  False   False
11  False  False   False
12  False  False   False
13  False  False   False
14  False  False   False
15  False   True   False

In [4]:
df.isnull().sum()

name      0
age       3
salary    0
dtype: int64

In [5]:
df.dropna()

       name   age  salary
0    suresh  21.0   10000
1    ramesh  23.0   30000
2     alice  23.0   32000
3       bob  24.0   20000
4    mahesh  26.0   29000
5     virat  32.0   45000
7      gill  45.0   10000
8   shubham  32.0   21000
10     jagu  34.0   38000
11    ishan  34.0   23000
12    kisan  41.0   23900
13    harry  42.0   21000
14  sundhar  23.0   45000

In [6]:
df.dropna(inplace = True)

In [7]:
df

       name   age  salary
0    suresh  21.0   10000
1    ramesh  23.0   30000
2     alice  23.0   32000
3       bob  24.0   20000
4    mahesh  26.0   29000
5     virat  32.0   45000
7      gill  45.0   10000
8   shubham  32.0   21000
10     jagu  34.0   38000
11    ishan  34.0   23000
12    kisan  41.0   23900
13    harry  42.0   21000
14  sundhar  23.0   45000

In [8]:
df.fillna(23,inplace = True)

In [9]:
df['age'].fillna(df['age'].mean(),inplace = True)

In [10]:
df['age'].fillna(df['age'].median(),inplace = True)

In [11]:
df

       name   age  salary
0    suresh  21.0   10000
1    ramesh  23.0   30000
2     alice  23.0   32000
3       bob  24.0   20000
4    mahesh  26.0   29000
5     virat  32.0   45000
7      gill  45.0   10000
8   shubham  32.0   21000
10     jagu  34.0   38000
11    ishan  34.0   23000
12    kisan  41.0   23900
13    harry  42.0   21000
14  sundhar  23.0   45000

In [12]:
df['age'].value_counts()

age
23.0    3
34.0    2
32.0    2
21.0    1
24.0    1
26.0    1
45.0    1
41.0    1
42.0    1
Name: count, dtype: int64

In [13]:
df['age'].value_counts().sort_index()

age
21.0    1
23.0    3
24.0    1
26.0    1
32.0    2
34.0    2
41.0    1
42.0    1
45.0    1
Name: count, dtype: int64

In [14]:
df['age'].value_counts(normalize = True)

age
23.0    0.230769
34.0    0.153846
32.0    0.153846
21.0    0.076923
24.0    0.076923
26.0    0.076923
45.0    0.076923
41.0    0.076923
42.0    0.076923
Name: proportion, dtype: float64

In [15]:
df['age'].unique()

array([21., 23., 24., 26., 32., 45., 34., 41., 42.])

In [16]:
df['age'].nunique()

9

In [17]:
df['age'].dropna(inplace = False)

0     21.0
1     23.0
2     23.0
3     24.0
4     26.0
5     32.0
7     45.0
8     32.0
10    34.0
11    34.0
12    41.0
13    42.0
14    23.0
Name: age, dtype: float64

In [18]:
df['age'].sort_values()

0     21.0
1     23.0
2     23.0
14    23.0
3     24.0
4     26.0
8     32.0
5     32.0
11    34.0
10    34.0
12    41.0
13    42.0
7     45.0
Name: age, dtype: float64

In [19]:
df['age'].sort_values(ascending = False)

7     45.0
13    42.0
12    41.0
10    34.0
11    34.0
8     32.0
5     32.0
4     26.0
3     24.0
2     23.0
1     23.0
14    23.0
0     21.0
Name: age, dtype: float64

In [20]:
df.sort_values(['age','salary'],ascending = [False,True])

       name   age  salary
7      gill  45.0   10000
13    harry  42.0   21000
12    kisan  41.0   23900
11    ishan  34.0   23000
10     jagu  34.0   38000
8   shubham  32.0   21000
5     virat  32.0   45000
4    mahesh  26.0   29000
3       bob  24.0   20000
1    ramesh  23.0   30000
2     alice  23.0   32000
14  sundhar  23.0   45000
0    suresh  21.0   10000

In [21]:
df.sort_values('age',inplace = True)

In [22]:
df

       name   age  salary
0    suresh  21.0   10000
1    ramesh  23.0   30000
2     alice  23.0   32000
14  sundhar  23.0   45000
3       bob  24.0   20000
4    mahesh  26.0   29000
8   shubham  32.0   21000
5     virat  32.0   45000
11    ishan  34.0   23000
10     jagu  34.0   38000
12    kisan  41.0   23900
13    harry  42.0   21000
7      gill  45.0   10000

In [23]:
df.sort_index()

       name   age  salary
0    suresh  21.0   10000
1    ramesh  23.0   30000
2     alice  23.0   32000
3       bob  24.0   20000
4    mahesh  26.0   29000
5     virat  32.0   45000
7      gill  45.0   10000
8   shubham  32.0   21000
10     jagu  34.0   38000
11    ishan  34.0   23000
12    kisan  41.0   23900
13    harry  42.0   21000
14  sundhar  23.0   45000

In [24]:
df.sort_values('age',ascending = False)

       name   age  salary
7      gill  45.0   10000
13    harry  42.0   21000
12    kisan  41.0   23900
11    ishan  34.0   23000
10     jagu  34.0   38000
5     virat  32.0   45000
8   shubham  32.0   21000
4    mahesh  26.0   29000
3       bob  24.0   20000
1    ramesh  23.0   30000
14  sundhar  23.0   45000
2     alice  23.0   32000
0    suresh  21.0   10000

In [25]:
df['age'].count()

np.int64(13)

In [26]:
df.fillna(25,inplace = True)

In [27]:
df

       name   age  salary
0    suresh  21.0   10000
1    ramesh  23.0   30000
2     alice  23.0   32000
14  sundhar  23.0   45000
3       bob  24.0   20000
4    mahesh  26.0   29000
8   shubham  32.0   21000
5     virat  32.0   45000
11    ishan  34.0   23000
10     jagu  34.0   38000
12    kisan  41.0   23900
13    harry  42.0   21000
7      gill  45.0   10000

In [28]:
df.fillna(25, inplace=True)

In [29]:
df['age'].count()

np.int64(13)

In [30]:
df['age'].size

13

In [31]:
len(df['age'])

13

In [32]:
df['age'].shape

(13,)

In [33]:
df

       name   age  salary
0    suresh  21.0   10000
1    ramesh  23.0   30000
2     alice  23.0   32000
14  sundhar  23.0   45000
3       bob  24.0   20000
4    mahesh  26.0   29000
8   shubham  32.0   21000
5     virat  32.0   45000
11    ishan  34.0   23000
10     jagu  34.0   38000
12    kisan  41.0   23900
13    harry  42.0   21000
7      gill  45.0   10000